## Kütüphanenin içe aktarılması

In [2]:
import pandas as pd

![](https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png)

## Seriler

In [3]:
meyveler = ["Elma","Armut","Portakal","Karpuz"]
seri1 = pd.Series(meyveler)
seri1

0        Elma
1       Armut
2    Portakal
3      Karpuz
dtype: object

In [4]:
miktar = [30,150,200,1000]
seri2 = pd.Series(miktar)
seri2

0      30
1     150
2     200
3    1000
dtype: int64

In [5]:
miktar = [30,150,200,1000]
seri2 = pd.Series(miktar,index=["a","b","c","d"])
seri2

a      30
b     150
c     200
d    1000
dtype: int64

In [6]:
miktar = [30,150,200,1000]
meyveler = ["Elma","Armut","Portakal","Karpuz"]
df = pd.DataFrame({"Adı":meyveler,
                   "Miktar":miktar,
                   "Fiyat":[150,120,200,1000]})
df

        Adı  Miktar  Fiyat
0      Elma      30    150
1     Armut     150    120
2  Portakal     200    200
3    Karpuz    1000   1000

### Dosya okuma

In [13]:
# adres = r"C:\talat\nalan\buse.html"
# print(adres)

C:\talat\nalan\buse.html

In [28]:
adres = "/workspace/pythonfundamentals/Dokumanlar/04_Libraries/data/data.csv"
df = pd.read_csv(adres)
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

### Yardımcı Fonksiyonlar
* head
* tail
* describe
* dtypes
* shape
* info

#### Head

In [29]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [30]:
df.head(10)

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94
5  131876.90        99814.71        362861.36    New York  156991.12
6  134615.46       147198.87        127716.82  California  156122.51
7  130298.13       145530.06        323876.68     Florida  155752.60
8  120542.52       148718.95        311613.29    New York  152211.77
9  123334.88       108679.17        304981.62  California  149759.96

In [31]:
df.tail()

    R&D Spend  Administration  Marketing Spend       State    Profit
45    1000.23       124153.04          1903.93    New York  64926.08
46    1315.46       115816.21        297114.46     Florida  49490.75
47       0.00       135426.92             0.00  California  42559.73
48     542.05        51743.15             0.00    New York  35673.41
49       0.00       116983.80         45173.06  California  14681.40

In [32]:
df.tail(10)

    R&D Spend  Administration  Marketing Spend       State    Profit
40   28754.33       118546.05        172795.67  California  78239.91
41   27892.92        84710.77        164470.71     Florida  77798.83
42   23640.93        96189.63        148001.11  California  71498.49
43   15505.73       127382.30         35534.17    New York  69758.98
44   22177.74       154806.14         28334.72  California  65200.33
45    1000.23       124153.04          1903.93    New York  64926.08
46    1315.46       115816.21        297114.46     Florida  49490.75
47       0.00       135426.92             0.00  California  42559.73
48     542.05        51743.15             0.00    New York  35673.41
49       0.00       116983.80         45173.06  California  14681.40

#### describe

In [33]:
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

### .loc ve .iloc

In [7]:
hayvanlar = pd.Series(["kedi","kopek","kuş","yılan","kurbağa","penguen"],
index=[0,3,9,8,67,3])
hayvanlar

0        kedi
3       kopek
9         kuş
8       yılan
67    kurbağa
3     penguen
dtype: object

In [8]:
hayvanlar.loc[3]

3      kopek
3    penguen
dtype: object

In [9]:
hayvanlar.iloc[3]

'yılan'